;;---------------------------------------------------------------------------------------
;;  FILE:   XComGame Loco file for More Amps.uc                                    
;;
;;	File by RustyDios	
;;
;;	File created	07/09/20    17:00
;;	LAST UPDATED    09/09/20    01:30
;;
;;---------------------------------------------------------------------------------------

[OneMorePsiAmp_CV X2WeaponTemplate]
FriendlyName="Depleted Psi Implant"
FriendlyNamePlural="Depleted Psi Implant"
BriefSummary="The Psi Implant allows Psi Operative's to perform their Psionic abilities. More advanced Psi Implants can increase the Operative's Psionic strength, and the effectiveness of their abilities."
TacticalText="<Bullet/> The Psi Implant allows Psi Operative's to perform their Psionic abilities.\n<Bullet/> More advanced Psi Implants can increase the Operative's Psionic strength, and the effectiveness of their abilities."
AbilityDescName="Psi Implant"

[OneMorePsiAmp_MG X2WeaponTemplate]
FriendlyName="Advent Psi Implant"
FriendlyNamePlural="Advent Psi Implant"
BriefSummary="This evolved version of the Psi Implant channels the user's Psionic energy far more clearly, enabling greater Psionic strength in our operatives. Psi Offense and Psionic attack damage of some abilities is improved when using this implant."
TacticalText="<Bullet/> The Advent Psi Implant increases a Psi Operative's Psionic strength by +20.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.\n<Bullet/> The Advent Psi Implant also increases the damage done by many Psionic attacks."
AbilityDescName="Psi Implant"

[OneMorePsiAmp_BM X2WeaponTemplate]
FriendlyName="Elerium Psi Implant"
FriendlyNamePlural="Elerium Psi Implant"
BriefSummary="This version of the Psi Implant incorporates artifacts from the powerful \"Gatekeeper\" alien we encountered. It will put our experienced Psi Operative's on the same level as the aliens' most powerful Psionic forces."
TacticalText="<Bullet/> The Psi Implant increases a Psi Operative's Psionic strength by +40.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.<Bullet/> The Elerium Psi Implant also increases the damage done by many Psionic attacks."
AbilityDescName="Psi Implant"

[PsiAmp_MG_Schematic X2SchematicTemplate]
m_strClassLabel="PSIONICS"
[PsiAmp_BM_Schematic X2SchematicTemplate]
m_strClassLabel="PSIONICS"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  MOD SUPPORT - Playable Aliens
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[SectoidAmp_CV X2WeaponTemplate]
FriendlyName="Depleted Sectoid Implant"
FriendlyNamePlural="Depleted Sectoid Implants"
BriefSummary="While Sectoids have increased psionic strength from the introduction of human DNA, they now need psionic implants designed for them to effectively control their strength."
TacticalText="<Bullet/> While Sectoids have increased psionic strength from the introduction of human DNA, they now need psionic implants designed for them to effectively control their strength."
AbilityDescName="Sectoid Implant"

[SectoidAmp_MG X2WeaponTemplate]
FriendlyName="Advent Sectoid Implant"
FriendlyNamePlural="Sectoid Implants"
BriefSummary="While Sectoids have increased psionic strength from the introduction of human DNA, they now need psionic implants designed for them to effectively control their strength."
TacticalText="<Bullet/> While Sectoids have increased psionic strength from the introduction of human DNA, they now need psionic implants designed for them to effectively control their strength."
AbilityDescName="Sectoid Implant"

[SectoidAmp_BM X2WeaponTemplate]
FriendlyName="Elerium Sectoid Implant"
FriendlyNamePlural="Powered Sectoid Implants"
BriefSummary="While Sectoids have increased psionic strength from the introduction of human DNA, they now need psionic implants designed for them to effectively control their strength."
TacticalText="<Bullet/> While Sectoids have increased psionic strength from the introduction of human DNA, they now need psionic implants designed for them to effectively control their strength."
AbilityDescName="Sectoid Implant"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  MOD SUPPORT - Biotic Class
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[RM_BioAmp_CV X2WeaponTemplate]
FriendlyName="Depleted Biotic Implant"
FriendlyNamePlural="Biotic Implants"
BriefSummary="A Biotic Implant allows Biotics to perform their biotic abilities.\n<Bullet/> More advanced Biotic Implants can increase the biotic's psionic strength, and the effectiveness of their abilities."
TacticalText="<Bullet/> A Biotic Implant allows Biotics to perform their biotic abilities.\n<Bullet/> More advanced Biotic Implants can increase the biotic's psionic strength, and the effectiveness of their abilities."

[RM_BioAmp_MG X2WeaponTemplate]
FriendlyName="Advent Biotic Implant"
FriendlyNamePlural="Advanced Biotic Implants"
BriefSummary="This evolved version of the Biotic Implant channels the user's dark energy far more clearly, enabling greater biotic strength in our operatives. Psi Offense and biotic attack damage of some abilities is improved when using this implant."
TacticalText="<Bullet/> The Advent Biotic Implant increases a Biotic's psionic strength by +20.\n<Bullet/> Psi Strength determines the potency of some of your biotic abilities.\n<Bullet/> The Advent Biotic Implant also increases the damage done by many biotic attacks."

[RM_BioAmp_BM X2WeaponTemplate]
FriendlyName="Elerium Biotic Implant"
FriendlyNamePlural="Elerium Biotic Implants"
BriefSummary="This version of the Biotic Implant incorporates the alien element Elerium-117, along with technology from the powerful \"Gatekeeper\" alien we encountered. It will enable our biotics to compete with the strongest of the Aliens' psionic forces."
TacticalText="<Bullet/> The Elerium Biotic Implant increases a Biotic's psionic strength by +40.\n<Bullet/> Psi Strength determines the potency of some of your biotic abilities.<Bullet/> The Elerium Biotic Implant also increases the damage done by many biotic attacks."

[RM_BioAmp_MG_Schematic X2SchematicTemplate]
m_strClassLabel="BIONICS"
[RM_BioAmp_BM_Schematic X2SchematicTemplate]
m_strClassLabel="BIONICS"
